STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/usbpd_vdm_user.c
          vdo_received.d32 = pVDO[0];

          VDM_USER_DEBUG_TRACE(PortNum, "USBPD_VDM_InformSpecific(DP_STATUS)");
          if (vdo_received.d.ConnectStatus != MODE_DP_STATUS_CONNECT_NO)
          {
            sDP_Status[PortNum].d.ConnectStatus = MODE_DP_STATUS_CONNECT_UFP_D;
          }
          else
          {
            /* DP not connected */
            sDP_Status[PortNum].d.ConnectStatus = MODE_DP_STATUS_CONNECT_NO;
          }
        }
        break;
      case SVDM_DP_CONFIG :
        VDM_USER_DEBUG_TRACE(PortNum, "USBPD_VDM_InformSpecific(DP_CONFIG)");
        break;

      default :
        break;
      }
    }
#endif /* _VDM */
#if defined(_VCONN_SUPPORT)
  }
#endif /* _VCONN_SUPPORT */
}
#endif /* _VDM || _VCONN_SUPPORT */

#if defined(_UVDM)
/**
  * @brief  VDM Send Unstructured message callback
  * @param  PortNum       current port number
  * @param  pUVDM_Header  Pointer on UVDM header based on @ref USBPD_UVDMHeader_TypeDef
  * @param  pNbData       Pointer of number of VDO to send
  * @param  pVDO          Pointer of VDO to send
  * @retval None
  */
static void USBPD_VDM_SendUVDM(uint8_t PortNum, USBPD_UVDMHeader_TypeDef *pUVDM_Header, uint8_t *pNbData, uint32_t *pVDO)
{
  pUVDM_Header->b.VID = USBPD_VID;
  *pNbData            = 0;
}

/**
  * @brief  Unstructured VDM  message callback to inform user of reception of UVDM message
  * @param  PortNum    current port number
  * @param  UVDM_Header UVDM header based on @ref USBPD_UVDMHeader_TypeDef
  * @param  pNbData    Pointer of number of received VDO
  * @param  pVDO       Pointer of received VDO
  * @retval USBPD Status
  */
static USBPD_StatusTypeDef USBPD_VDM_ReceiveUVDM(uint8_t PortNum, USBPD_UVDMHeader_TypeDef UVDM_Header, uint8_t *pNbData, uint32_t *pVDO)
{
  USBPD_StatusTypeDef _status = USBPD_OK;

  if (USBPD_VID != UVDM_Header.b.VID)
  {
    _status = USBPD_ERROR;
  }
  return _status;
}
#endif /* _UVDM */

/* Exported functions ---------------------------------------------------------*/
/**
  * @brief  VDM Initialization function
  * @param  PortNum     Index of current used port
  * @retval status
  */
USBPD_StatusTypeDef USBPD_VDM_UserInit(uint8_t PortNum)
{
#if defined(_VDM)
  uint32_t index = 0;

   /* Initialize SVID supported by consumer */
  SVIDInfo[PortNum].NumSVIDs = MAX_SVID_USER;

  for (index = 0; index < MAX_SVID_USER; index++)
  {
    SVIDInfo[PortNum].SVIDs[index] = DISPLAY_PORT_SVID + index;
  }
#endif /* _VDM */

  USBPD_PE_InitVDM_Callback(PortNum, (USBPD_VDM_Callbacks *)&vdmCallbacks);

  return USBPD_OK;
}

#if defined(_VDM)
/**
  * @brief  VDM Reset function
  * @param  PortNum     Index of current used port
  * @retval status
  */
void USBPD_VDM_UserReset(uint8_t PortNum)
{
  /* Reset Port Partner variables*/
  Remote_CurrentSVID[PortNum]       = 0;
  /* Disconnect received on Type-C */
  VDM_Mode_On[PortNum] = 0;
}
#endif /* _VDM */

#endif /* _VDM || _UVDM || _VCONN_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

